Revit 2026 API
Application.NewFamilyDocument Method
 New family document, including family, titleblock, and annotation symbol
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual Document NewFamilyDocument(
	string templateFileName
)
Public Overridable Function NewFamilyDocument (
	templateFileName As String
) As Document
public:
virtual Document^ NewFamilyDocument(
	String^ templateFileName
)
abstract NewFamilyDocument :
        templateFileName : string -> Document
override NewFamilyDocument :
        templateFileName : string -> Document
Parameters
templateFileName String
The template file name.
Return Value
Document
Exceptions
Exception | Condition
ArgumentException | If 'templateFileName' is null or an empty string.
InvalidOperationException | If the new family document cannot be created.
Remarks
 This command corresponds to File->New->Family.../TitleBlock.../Annotation Symbol....
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace